
#include <reg52.h>
#include "config.h"

//PCA相关寄存器
sfr CMOD = 0xD9;   //钟源选择控制等
sfr CH = 0xF9;     //PCA的计数器
sfr CL = 0xE9;     //PCA的计数器
sfr CCON = 0xD8;   //PCA控制寄存器
sfr CCPAM0 = 0xDA; //PCA模块0工作模式寄存器
sfr CCPAM1 = 0xDB; //PCA模块1工作模式寄存器
sfr CCAP0L = 0xEA; //模块0捕获寄存器低位
sfr CCAP0H = 0xFA; //模块0捕获寄存器高位
sfr IPH = 0xB7;

sbit PPCA  = IP^7;   //PCA的中断优先级设置
sbit CCF0  = CCON^0; //PCA的模块0中断标志
sbit CCF1  = CCON^1; //PCA的模块1中断标志
sbit CR = CCON^6;    //PCA计数器使能

sbit KFB = P1^2;//移相方波输出口
sbit K32 = P1^1; //32kHz发生器

//标准频率
unsigned int code frqB[3]={100,977,7813};
//DDS步进值  Step=f*2^16/62500
unsigned int code Step[3]={105,1049,8193};
//查询表中不可装载零值，否则会造成无中断产生
unsigned char code sinB[256]={
 255,255,255,255,255,255,254,254,253,252,252,251,250,249,248,247,246,245,243,242,240,239,237,236,234,232,230,229,227,225,222,220,
 218,216,214,211,209,206,204,201,199,196,194,191,188,185,183,180,177,174,171,168,165,162,159,156,153,150,147,144,140,137,134,131,
 128,125,122,119,116,112,109,106,103,100, 97, 94, 91, 88, 85, 82, 79, 76, 73, 71, 68, 65, 62, 60, 57, 55, 52, 50, 47, 45, 42, 40,
  38, 36, 34, 31, 29, 27, 26, 24, 22, 20, 19, 17, 16, 14, 13, 11, 10,  9,  8,  7,  6,  5,  4,  4,  3,  2,  2,  1,  1,  1,  1,  1,
   1,  1,  1,  1,  1,  1,  2,  2,  3,  4,  4,  5,  6,  7,  8,  9, 10, 11, 13, 14, 16, 17, 19, 20, 22, 24, 26, 27, 29, 31, 34, 36,
  38, 40, 42, 45, 47, 50, 52, 55, 57, 60, 62, 65, 68, 71, 73, 76, 79, 82, 85, 88, 91, 94, 97,100,103,106,109,112,116,119,122,125,
 128,131,134,137,140,144,147,150,153,156,159,162,165,168,171,174,177,180,183,185,188,191,194,196,199,201,204,206,209,211,214,216,
 218,220,222,225,227,229,230,232,234,236,237,239,240,242,243,245,246,247,248,249,250,251,252,252,253,254,254,255,255,255,255,255
};
unsigned char code fbB[256]={ //方波DDS查询表
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1};

extern  Frq_idx;
unsigned int Sin_Phase=0;  //正弦相位累加值
xdata float Actual_Frq=976.6; //实际输出频率


unsigned char chuX=0; //方波DDS初相
xdata unsigned char xw=0; //相位
xdata unsigned char tim=0,tims=0;
int DDS3=1;
unsigned char mT = 6; //测量速度,mT取值为6或12或24时，可以消除数字噪声，尾数不动，但不利于于取平均


/***********************************************************************
Function : PWM_Init 
Note     : PWM初始化
***********************************************************************/
void PWM_init (void){  
  CMOD = 2;        //0000 0010 计数源选择,钟源取fosc/2
  CL = 0; CH = 0;  //计数器置零
  CCAP0L = 0xC0; CCAP0H = 0xC0; //占空比为25%
  CCPAM0=0x53;  //0101 0011,PCA的模块0设置为PWM模式,有中断，下降沿中断
  PPCA = 1;     //优先中断
  CR = 1;   //开始计数
    }  

/***********************************************************************
Function : PCAinter interrupt
Note     : PCA中断处理函数
Updata   : 2013-06-18
***********************************************************************/
void PCAinter(void) interrupt 7 
{
  unsigned char x,y;
  CCF0=0;          //清除中断请求,以免反复中断
  x = Sin_Phase << 8 ;        //截断正弦相位累加器,取高8位
  y = x + chuX;    //方波相位
  CCAP0H = sinB[x];//正弦DDS输出
  KFB = fbB[y];   //方波DDS输
  Sin_Phase += Step[Frq_idx];       //相位累加
  K32 = ~K32;
}

/***********************************************************************
Function : setDDS
Note     : 低频信号DDS函数
           参考时钟是c=(fosc/2)/256=32000000/2/256=62500,频率f=c*Step/2^16
***********************************************************************/
void setDDS(unsigned char frqIndex){ 
 //Actual_Frq = frqB[frqIndex]*(1+cs.feq/10000.0);  //实际输出频率 加修正值
 Actual_Frq = frqB[frqIndex];
 Sin_Phase = 0;                                   //高频时，使波形对称
}    

/***********************************************************************
Function : set90
Note     : 设置方波的相位差
***********************************************************************/
void set90(char k){ 
  k %= 4;
  if(k<0) k += 4;
  chuX = k*64;   //移相0~270度
  xw = k;
}



 

